/******************** 首页填充数据 *****************************/
// 首页轮播楼层数据
export const carouselList_ = [
    {
        id: 0,
        pic: '/202009/20200923151002_513960.png',
    },
    {
        id: 1,
        pic: '/202009/20200923151002_513960.png',
    },
    {
        id: 2,
        pic: '/202009/20200923151002_513960.png',
    }
]
// 首页分类数据
export const categoryList_ = [
    {
        id: 0,
        icon: '/202009/20200923151002_513960.png',
        name: '手机数码'
    },
    {
        id: 1,
        icon: '/202009/20200923151002_513960.png',
        name: '食品生鲜'
    },
    {
        id: 2,
        icon: '/202009/20200923151002_513960.png',
        name: '家用电器'
    },
    {
        id: 3,
        icon: '/202009/20200923151002_513960.png',
        name: '美妆个护'
    },
    {
        id: 4,
        icon: '/202009/20200923151002_513960.png',
        name: '户外运动'
    },
    {
        id: 5,
        icon: '/202009/20200923151002_513960.png',
        name: '电脑办公'
    }
    , {
        id: 6,
        icon: '/202009/20200923151002_513960.png',
        name: '服装内衣'
    }
    , {
        id: 7,
        icon: '/202009/20200923151002_513960.png',
        name: '轻奢箱包'
    },
    {
        id: 8,
        icon: '/202009/20200923151002_513960.png',
        name: '珠宝钟表'
    }
    , {
        id: 9,
        icon: '/202009/20200923151002_513960.png',
        name: '更多分类'
    }

]
// 首页新品推荐楼层数据
export const newProduct_ = [
    {
        id: 0,
        pic: '/202009/20200923151002_513960.png',
    },
    {
        id: 1,
        pic: '/202009/20200923151002_513960.png',
    },
    {
        id: 2,
        pic: '/202009/20200923151002_513960.png',
    }
]

/******************** 商品填充数据 *****************************/
//商品大图数据
export const goodsImageList_ = ["/default.png"];

//商品详情数据
export const productInfo_ = {
    "price": 50.00,
    "originalPrice": 59.99,
    "name": "模拟商品，请勿操作",
    "sale": 1000,
    "stock": 100,
    "collectionCount": 200,
}
//店铺数据
export const shopInfo_ = {
    "shopName": "店铺名称店铺名称",
    "shopLogo": "/202009/20200923151002_513960.png",
    "shopNumber": 100,
    "shopGoodsNum": 100,
}

//参数数据
export const paramsList_ = [
    {"name": "参数1"}, {"name": "参数1"}, {"name": "参数1"}
]
//服务数据
export const tagList_ = [
    {"name": "服务1"}, {"name": "服务1"}, {"name": "服务1"}
]

//商品列表
export const goodsList_ = [
    {
        "name": "模拟商品，请勿操作",
        "pic": "/202009/20200923151002_513960.png",
        "price": 50.00,
        "sale": 100
    },
    {
        "name": "模拟商品，请勿操作",
        "pic": "/202009/20200923151002_513960.png",
        "price": 50.00,
        "sale": 100
    },
    {
        "name": "模拟商品，请勿操作",
        "pic": "/202009/20200923151002_513960.png",
        "price": 50.00,
        "sale": 100
    },
	{
	    "name": "模拟商品，请勿操作",
	    "pic": "/202009/20200923151002_513960.png",
	    "price": 50.00,
	    "sale": 100
	},
	{
	    "name": "模拟商品，请勿操作",
	    "pic": "/202009/20200923151002_513960.png",
	    "price": 50.00,
	    "sale": 100
	}
]

/********************** 店铺首页填充数据 ****************/

export const shoplunbolist_ = [
	{
		image: '/202009/20200923151002_513960.png',
		title: '模拟店铺轮播图',
		url: ''
	}
] ;

export const shophostlist_ = [
	{
		pic: '/202009/20200923151002_513960.png',
		name: '模拟商品，请勿操作',
		price: 10.00
	},
	{
		pic: '/202009/20200923151002_513960.png',
		name: '模拟商品，请勿操作',
		price: 10.00
	},
	{
		pic: '/202009/20200923151002_513960.png',
		name: '模拟商品，请勿操作',
		price: 10.00
	},
] ;
				
				
				